orgsrc/topics/data-analysis/cern-root.org
# -*- mode: org; coding: utf-8; -*-
#+SETUPFILE: ../../../setup/ox-tmpl/l2.org
#+HTML_LINK_UP: ../index.html
#+TITLE: 心蛛的 ROOT 笔记

* 基本信息

- URL -- http://root.cern.ch
- 论坛 -- http://root.cern.ch/phpBB3/
- GitWeb -- http://root.cern.ch/gitweb

* Debian 下的 ROOT

Debian 7 (Wheezy):
  - root-system: 5.34.00-2
  - libroot-bindings-python5.34: 5.34.00-2
  - libroot-bindings-python-dev: 5.34.00-2
  - http://packages.debian.org/wheezy/root-system

ROOT 文档：
  - 入门教材: [[http://root.cern.ch/download/doc/primer/ROOTPrimer.html][ROOT Primer]]
  - 参考手册: [[http://root.cern.ch/drupal/content/users-guide][ROOT User's Guide]]
  - 类库参考: [[http://root.cern.ch/drupal/content/reference-guide][ROOT Reference Guide]]

* PyROOT

** PyROOT 的基本使用

*注意*: ROOT 6.0 以后将放弃使用 CINT, 而采用基于 LLVM 的 CLING, 因此，与 CINT 相
关的内容只限于 ROOT 5 及以前的版本。

*** 在 Python 中调用 ROOT 类

在调用之前，需要加载 ~ROOT~ 包中的模块。示例：
#+begin_src python
  from ROOT import TCanvas # available at startup
  c=TCanvas()
  
  from ROOT import TLorentzVector  # triggers auto-load of libPhysics
  l = TLorentzVector()
#+end_src

或者 (不推荐) 这样用:
#+begin_src python
  from ROOT import *
  c = TCanvas()
  l = TLorentzVector()
#+end_src

最佳用法:
#+begin_src python
  import ROOT
  
  c = ROOT.TCanvas()
  l = ROOT.TLorentzVector()
#+end_src

*** 使用 STL 类

不推荐在 Python 中使用 STL 类，因为 Python 中有相似的类存在，且功能之间有差异，
易出错，在使用中需特别小心。

使用模板类的方法很简单，将通用模板当成 meta class, 使用使用相应的参数实现这个
meta class 即可，然后将实现的 (instantiated) 类当成普通的新类使用。示例:
#+begin_example
  >>> from ROOT import std
  >>> v = std.vector(int)()
  >>> for i in range(0,10):
  ...    v.push_back(i)
  ...
  >>> for i in v:
  ...     print i,
  1 2 3 4 5 6 7 8 9
  >>>
  >>> list(v)
  [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
  >>>
#+end_example

STL 的模板参数使用复杂类，比如 TCanvas 等，会出错。最好使用简单的数据类型，比如
int, double 等。

*** 访问 ROOT 全局变量

大部分全局变量可以直接从 ROOT.py 中导入，但一些通用模块 (通常如 ~gMinuit~ 等) 在
程序开始时变未加载，只在相应的模块后续载入时才会存在 (也就是说，通过自动加载机制)。
例如:
#+begin_example
  >>> from ROOT import *
  >>> gROOT                              # directly available
  <ROOT.TROOT object at 0x399c30>
  >>> gMinuit                            # library not yet loaded: not available
  Traceback (most recent call last):
    File "<stdin>", line 1, in ?
  NameError: name 'gMinuit' is not defined
  >>> TMinuit                            # use of TMinuit class forces auto-loading
  <class '__main__.TMinuit'>
  >>> gMinuit                            # now gMinuit is available
  <__main__.TMinuit object at 0x1458c70>
  >>> not not gMinuit                    # but it is the null pointer, until set
  False
  >>> g = TMinuit()
  >>> not not gMinuit
  True     
#+end_example

可交互式地创建全局变量，也可以通过执行 CINT 宏，或者调用
~gROOT.ProcessLine()~. 全局变量的使用与类相似：直接通过 ~from ROOT import *~加载，
或者从 ROOT 名称空间 (namespace) 中通过 ~import ROOT~ 获得。

5.08 版本以后, ROOT 全局变量的表现与 python 全局变量相同，这有时会有点反直观。由
于它们是引用 (references), 它们只可以直接通过包含它们的模块进行改变。如下示例进
行了展示:
#+begin_example
  >>> from ROOT import *
  >>> print gDebug
  0
  >>> gROOT.ProcessLine( 'gDebug = 7;' )
  >>> print gDebug
  0                                 # local gDebug is unchanged
  >>> gDebug = 5                    # changes _local_ reference only
  >>> print gDebug
  5                                 # locally correct, but ...
  >>> gROOT.ProcessLine( 'cout << gDebug << endl;' )
  7                                 # ... ROOT global unchanged
  >>> import ROOT
  >>> print ROOT.gDebug
  7                                 # still the old value (not '5')
  >>> ROOT.gDebug = 3               # changes ROOT module reference
  >>> gROOT.ProcessLine( 'cout << gDebug << endl;' )
  3                                 # ROOT global properly changed
  >>>
#+end_example

上例同样说明 ~import ROOT~ 比 ~from ROOT import *~ 要更好些。

