topics/data-analysis/cern-root.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>心蛛的 ROOT 笔记</title>
<!-- 2013-07-19 五 22:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />


<link rel="stylesheet" type="text/css" href="../../css/worg.css" />
<link rel="alternate stylesheet" type="text/css" href="../../css/worg-zenburn.css" />
<link rel="alternate stylesheet" type="text/css" href="../../css/worg-classic.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">心蛛的 ROOT 笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">基本信息</a></li>
<li><a href="#sec-2">Debian 下的 ROOT</a></li>
<li><a href="#sec-3">PyROOT</a>
<ul>
<li><a href="#sec-3-1">PyROOT 的基本使用</a>
<ul>
<li><a href="#sec-3-1-1">在 Python 中调用 ROOT 类</a></li>
<li><a href="#sec-3-1-2">使用 STL 类</a></li>
<li><a href="#sec-3-1-3">访问 ROOT 全局变量</a></li>
<li><a href="#sec-3-1-4">从 C++ (CINT) 中访问 Python</a></li>
<li><a href="#sec-3-1-5">回调 (callbacks)</a></li>
<li><a href="#sec-3-1-6">CINT commands</a></li>
</ul>
</li>
<li><a href="#sec-3-2">内存管理</a>
<ul>
<li><a href="#sec-3-2-1">自动内存管理</a></li>
<li><a href="#sec-3-2-2">手动内存管理</a></li>
</ul>
</li>
<li><a href="#sec-3-3">性能</a></li>
<li><a href="#sec-3-4">使用 Python 函数</a>
<ul>
<li><a href="#sec-3-4-1">使用 Python 函数绘图</a></li>
<li><a href="#sec-3-4-2">拟合谱</a></li>
</ul>
</li>
<li><a href="#sec-3-5">使用 Tree</a>
<ul>
<li><a href="#sec-3-5-1">访问现有的 Tree</a></li>
<li><a href="#sec-3-5-2">写入 Tree</a></li>
</ul>
</li>
<li><a href="#sec-3-6">使用自己的类</a></li>
</ul>
</li>
<li><a href="#sec-4">我的 FAQ</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">基本信息</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>URL &#x2013; <a href="http://root.cern.ch">http://root.cern.ch</a>
</li>
<li>论坛 &#x2013; <a href="http://root.cern.ch/phpBB3/">http://root.cern.ch/phpBB3/</a>
</li>
<li>GitWeb &#x2013; <a href="http://root.cern.ch/gitweb">http://root.cern.ch/gitweb</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Debian 下的 ROOT</h2>
<div class="outline-text-2" id="text-2">
<p>
Debian 7 (Wheezy):
</p>
<ul class="org-ul">
<li>root-system: 5.34.00-2
</li>
<li>libroot-bindings-python5.34: 5.34.00-2
</li>
<li>libroot-bindings-python-dev: 5.34.00-2
</li>
<li><a href="http://packages.debian.org/wheezy/root-system">http://packages.debian.org/wheezy/root-system</a>
</li>
</ul>

<p>
ROOT 文档：
</p>
<ul class="org-ul">
<li>入门教材: <a href="http://root.cern.ch/download/doc/primer/ROOTPrimer.html">ROOT Primer</a>
</li>
<li>参考手册: <a href="http://root.cern.ch/drupal/content/users-guide">ROOT User's Guide</a>
</li>
<li>类库参考: <a href="http://root.cern.ch/drupal/content/reference-guide">ROOT Reference Guide</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">PyROOT</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">PyROOT 的基本使用</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b>注意</b>: ROOT 6.0 以后将放弃使用 CINT, 而采用基于 LLVM 的 CLING, 因此，与 CINT 相
关的内容只限于 ROOT 5 及以前的版本。
</p>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">在 Python 中调用 ROOT 类</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
在调用之前，需要加载 <code>ROOT</code> 包中的模块。示例：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #c397d8;">from</span> ROOT <span style="color: #c397d8;">import</span> TCanvas <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">available at startup</span>
c=TCanvas()

<span style="color: #c397d8;">from</span> ROOT <span style="color: #c397d8;">import</span> TLorentzVector  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">triggers auto-load of libPhysics</span>
l = TLorentzVector()
</pre>
</div>

<p>
或者 (不推荐) 这样用:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #c397d8;">from</span> ROOT <span style="color: #c397d8;">import</span> *
c = TCanvas()
l = TLorentzVector()
</pre>
</div>

<p>
最佳用法:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #c397d8;">import</span> ROOT

c = ROOT.TCanvas()
l = ROOT.TLorentzVector()
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2">使用 STL 类</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
不推荐在 Python 中使用 STL 类，因为 Python 中有相似的类存在，且功能之间有差异，
易出错，在使用中需特别小心。
</p>

<p>
使用模板类的方法很简单，将通用模板当成 meta class, 使用使用相应的参数实现这个
meta class 即可，然后将实现的 (instantiated) 类当成普通的新类使用。示例:
</p>
<pre class="example">
&gt;&gt;&gt; from ROOT import std
&gt;&gt;&gt; v = std.vector(int)()
&gt;&gt;&gt; for i in range(0,10):
...    v.push_back(i)
...
&gt;&gt;&gt; for i in v:
...     print i,
1 2 3 4 5 6 7 8 9
&gt;&gt;&gt;
&gt;&gt;&gt; list(v)
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
&gt;&gt;&gt;
</pre>

<p>
STL 的模板参数使用复杂类，比如 TCanvas 等，会出错。最好使用简单的数据类型，比如
int, double 等。
</p>
</div>
</div>
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3">访问 ROOT 全局变量</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
大部分全局变量可以直接从 ROOT.py 中导入，但一些通用模块 (通常如 <code>gMinuit</code> 等) 在
程序开始时变未加载，只在相应的模块后续载入时才会存在 (也就是说，通过自动加载机制)。
例如:
</p>
<pre class="example">
&gt;&gt;&gt; from ROOT import *
&gt;&gt;&gt; gROOT                              # directly available
&lt;ROOT.TROOT object at 0x399c30&gt;
&gt;&gt;&gt; gMinuit                            # library not yet loaded: not available
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 1, in ?
NameError: name 'gMinuit' is not defined
&gt;&gt;&gt; TMinuit                            # use of TMinuit class forces auto-loading
&lt;class '__main__.TMinuit'&gt;
&gt;&gt;&gt; gMinuit                            # now gMinuit is available
&lt;__main__.TMinuit object at 0x1458c70&gt;
&gt;&gt;&gt; not not gMinuit                    # but it is the null pointer, until set
False
&gt;&gt;&gt; g = TMinuit()
&gt;&gt;&gt; not not gMinuit
True
</pre>

<p>
可交互式地创建全局变量，也可以通过执行 CINT 宏，或者调用
<code>gROOT.ProcessLine()</code>. 全局变量的使用与类相似：直接通过 <code>from ROOT import *~加载，
或者从 ROOT 名称空间 (namespace) 中通过 ~import ROOT</code> 获得。
</p>

<p>
5.08 版本以后, ROOT 全局变量的表现与 python 全局变量相同，这有时会有点反直观。由
于它们是引用 (references), 它们只可以直接通过包含它们的模块进行改变。如下示例进
行了展示:
</p>
<pre class="example">
&gt;&gt;&gt; from ROOT import *
&gt;&gt;&gt; print gDebug
0
&gt;&gt;&gt; gROOT.ProcessLine( 'gDebug = 7;' )
&gt;&gt;&gt; print gDebug
0                                 # local gDebug is unchanged
&gt;&gt;&gt; gDebug = 5                    # changes _local_ reference only
&gt;&gt;&gt; print gDebug
5                                 # locally correct, but ...
&gt;&gt;&gt; gROOT.ProcessLine( 'cout &lt;&lt; gDebug &lt;&lt; endl;' )
7                                 # ... ROOT global unchanged
&gt;&gt;&gt; import ROOT
&gt;&gt;&gt; print ROOT.gDebug
7                                 # still the old value (not '5')
&gt;&gt;&gt; ROOT.gDebug = 3               # changes ROOT module reference
&gt;&gt;&gt; gROOT.ProcessLine( 'cout &lt;&lt; gDebug &lt;&lt; endl;' )
3                                 # ROOT global properly changed
&gt;&gt;&gt;
</pre>

<p>
上例同样说明 <code>import ROOT</code> 比 <code>from ROOT import *</code> 要更好些。
</p>
</div>
</div>
