topics/data-analysis/cern-root.html
<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4">从 C++ (CINT) 中访问 Python</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
访问 Python 可通过 <b>TPython</b> 类，或者当 Python 对象或类在作用域内时直接使用。
<b>TPython</b> 类大致如下：
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #c397d8;">class</span> <span style="color: #e7c547;">TPython</span> {
<span style="color: #c397d8;">public</span>:
  <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">load a Python script as if it were a macro</span>
  <span style="color: #c397d8;">static</span> <span style="color: #e7c547;">void</span> <span style="color: #7aa6da;">LoadMacro</span>(<span style="color: #c397d8;">const</span> <span style="color: #e7c547;">char</span>* <span style="color: #e78c45;">name</span>);
  <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">execute a Python statement (e.g. "import ROOT")</span>
  <span style="color: #c397d8;">static</span> <span style="color: #e7c547;">void</span> <span style="color: #7aa6da;">Exec</span>(<span style="color: #c397d8;">const</span> <span style="color: #e7c547;">char</span>* <span style="color: #e78c45;">cmd</span>);
  <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">evaluate a Python expression (e.g. "1+1")</span>
  <span style="color: #c397d8;">static</span> <span style="color: #c397d8;">const</span> <span style="color: #e7c547;">TPyReturn</span>&amp; <span style="color: #7aa6da;">Eval</span>(<span style="color: #c397d8;">const</span> <span style="color: #e7c547;">char</span>* <span style="color: #e78c45;">expr</span>);
  <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">bind a ROOT object with, at the Python side, the name "label"</span>
  <span style="color: #c397d8;">static</span> <span style="color: #e7c547;">bool</span> <span style="color: #7aa6da;">Bind</span>(<span style="color: #e7c547;">TObject</span>* <span style="color: #e78c45;">obj</span>,<span style="color: #c397d8;">const</span> <span style="color: #e7c547;">char</span>* <span style="color: #e78c45;">label</span>);
  <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">enter an interactive Python session (exit with ^D)</span>
  <span style="color: #c397d8;">static</span> <span style="color: #e7c547;">void</span> <span style="color: #7aa6da;">Prompt</span>();
};
</pre>
</div>

<p>
<b>TPython</b> 的成员函数的详细解释:
</p>
<ul class="org-ul">
<li><code>LoadMacro(const char* name)</code> &#x2013; 参数为 Python 文件名，载入后其中的新类自动
可被 CINT 访问。由于 non-selective, 小心使用！
</li>
<li><code>ExecScript(const char* name, int argc=0, const char** argv=0)</code> &#x2013; 参数为
Python 文件名，在私用的名字空间内调用以避免边界效应 (side-effects)。另外，可
以通过添加命令行形式的参数，与在脚本中使用 <code>sys.argv</code> 参数相似。
</li>
<li><code>Exec(const char* cmd)</code> &#x2013; 参数为可执行的 Python 代码。没有返回值，但如果有
问题（比如语法错误）会输出错误信息。
</li>
<li><code>Eval(const char* expr)</code> &#x2013; 参数为可执行的 Python 代码字符串 (表达式). 如果
是内嵌类型 (int, long, float, double, const char*), 可访问的 Python 类型或者
ROOT 类型，则返回表达式执行的结果。如果返回的是 ROOT 类型，需要对 <code>void*</code> 进
行显式的强制转换 (explicit cast), 再赋值给本地指针 (可能存在类型不匹配), 而
内嵌类型是自动转换 (如果可能) 成本地变量所需要的类型。
</li>
<li><code>Bind(TObject* obj, const char* label)</code> &#x2013; 将 CINT 中的 ROOT 对象转换成
Python 解析器可接收的，在 Python 中变量名为 <code>label</code> 。
</li>
<li><code>Prompt()</code> &#x2013; 切换到 Python 提示符。
</li>
</ul>

<p>
ROOT v4.00/06 版本及以后, <code>TPython</code> 类在使用时自动加载，此前版本则需要在使用前先
通过 <code>gSystem-&gt;Load()</code> 加载 <code>libPyROOT.so</code> 模块。
</p>

<p>
使用一例: Python 模块如下
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #e78c45;">print</span> <span style="color: #b9ca4a;">'creating class MyPyClass ... '</span>
<span style="color: #c397d8;">class</span> <span style="color: #e7c547;">MyPyClass</span>:
   <span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">__init__</span>(<span style="color: #c397d8;">self</span>):
       <span style="color: #e78c45;">print</span> <span style="color: #b9ca4a;">'in MyPyClass.__init__'</span>
       <span style="color: #c397d8;">self</span>._browser = <span style="color: #c397d8;">None</span>
   <span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">gime</span>(<span style="color: #c397d8;">self</span>,what):
       <span style="color: #c397d8;">return</span> what
</pre>
</div>

<p>
在 CINT session 中这样调用:
</p>
<pre class="example">
root[] TPython::LoadMacro("MyPyClass.py");
creating class MyPyClass ...
root[] MyPyClass m;
in MyPyClass.__init__
root[] char* s = m.gime("aap");
root[] s
(char* 0x41ee7754)"aap"
</pre>
<p>
注意, <code>LoadMacro()</code> 调用使用类自动可用。否则需要先调用 <code>gROOT-&gt;GetClass()</code> 。
</p>
</div>
</div>
<div id="outline-container-sec-3-1-5" class="outline-4">
<h4 id="sec-3-1-5">回调 (callbacks)</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
从 CINT 中对 Python 进行回调，简单的方法是执行字符串。参见
<code>tutorials/pyroot/demo.py</code> 示例。
</p>
</div>
</div>
<div id="outline-container-sec-3-1-6" class="outline-4">
<h4 id="sec-3-1-6">CINT commands</h4>
<div class="outline-text-4" id="text-3-1-6">
<p>
在交互模式下, 使用 Python exception hook 来模拟一些 CINT 命令。这些命令有
</p>
<pre class="example">
.q, .!, .x, .L, .cd, .ls, .pwd, .?, .help
</pre>
<p>
注意, <code>.x</code> 命令对应的是 Python 的 <code>execfile()</code>, 因此只接收 Python 文件，而不是
CINT 宏。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">内存管理</h3>
<div class="outline-text-3" id="text-3-2">
<p>
在 Python 解析器中对用户内存通过引用计数和垃圾回收 (对新类型对象，包括~PyROOT~
对象) 进行管理。在 C++ 中，内存管理是手动进行的，或者通过应用程序特定的、定制的
机制 (如 ROOT 中所使用的) 进行。尽管 <code>PyROOT</code> 理解 ROOT 的内存管理机制，仍然会有
一些边界条件需要手动进行处理。 并且 <code>PyROOT</code> 对内存管理所采用的试探法
(heuristics) 并非绝对可靠。对方法的一些详细了解因此变得重要。
</p>
</div>

<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1">自动内存管理</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
有两种全局策略可用：试探式 (heuristics) 和严格式 (strict)。
</p>

<p>
默认使用的是试探式，它采用如下两种规则：
</p>
<ol class="org-ol">
<li>在 Python 解析器中创建的 ROOT 对象由 Python 拥有，当最后一次的 Python 引
用消除后会被删除。然而，如果，该对象由非常量地址作为参数传递给 C++ 函数
(除非该函数象成员函数中 <code>self</code> 那样使用它), 则放弃其所有权。
</li>
<li>来自 ROOT 调用的 ROOT 对象并非 Python 拥有，但在它传递给 Python 解析器之
前，如果该类型是 <b>TObject</b> 类的派生类，它的 <code>must cleanup</code> 位必须置位。当
对象离开 C++ 作用范围时, Python 对象必须改变类型，通常是 None。
</li>
</ol>

<p>
严格式策略与试探式不同，当对象作为参数传递给函数时, Python 从不放弃对象的所有权。
这样则需要由开发者来阻止双边删除 (double deletes) 的发生。
</p>

<p>
可通过如下命令
</p>
<pre class="example">
ROOT.SetMemoryPolicy( ROOT.kMemoryStrict )
</pre>
<p>
选择严格式策略，或通过如下选择试探式
</p>
<pre class="example">
ROOT.SetMemoryPolicy( ROOT.kMemoryHeuristics )
</pre>

<p>
对于图象对象需要特别注意: 当在当前 pad 上绘图时，对图象的引用保留着，但 <code>PyROOT</code>
却不会立即知道，这需要开发者保留着对象甚至某个 Python 引用激活。参见
<code>$ROOTSYS/tutorials/pyroot/zdemo.py</code> 中的示例。
</p>

<p>
另外，也可以直接告诉 Python 放弃对某个独立实现的拥有权:
</p>
<pre class="example">
o = ROOT.TObject()
ROOT.SetOwnership( o, False ) # True to own, False to release
</pre>
</div>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2">手动内存管理</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
如果需要，可通过相关联的 <b>TClass</b> 显示式摧毁一个你拥有的 ROOT 对象:
</p>
<pre class="example">
myobject.IsA().Destructor(myobject)
</pre>
<p>
该命令向系统发送一个删除通知 (因此你不用再关心此时 Python 的引用计数之类的，对象
会被删除，即使它的引用计数可能不会零), 并且释放相应内存。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">性能</h3>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">使用 Python 函数</h3>
<div class="outline-text-3" id="text-3-4">
</div><div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1">使用 Python 函数绘图</h4>
<div class="outline-text-4" id="text-3-4-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #c397d8;">from</span> ROOT <span style="color: #c397d8;">import</span> TF1, TCanvas

<span style="color: #c397d8;">class</span> <span style="color: #e7c547;">Linear</span>:
   <span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">__call__</span>( <span style="color: #c397d8;">self</span>, x, par ):
      <span style="color: #c397d8;">return</span> par[0] + x[0]*par[1]

<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">create a linear function with offset 5, and pitch 2</span>
f = TF1(<span style="color: #b9ca4a;">'pyf2'</span>,Linear(),-1.,1.,2)
f.SetParameters(5.,2.)

<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">plot the function</span>
c = TCanvas()
f.Draw()
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2">拟合谱</h4>
<div class="outline-text-4" id="text-3-4-2">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #c397d8;">from</span> ROOT <span style="color: #c397d8;">import</span> TF1, TH1F, TCanvas

<span style="color: #c397d8;">class</span> <span style="color: #e7c547;">Linear</span>:
   <span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">__call__</span>( <span style="color: #c397d8;">self</span>, x, par ):
      <span style="color: #c397d8;">return</span> par[0] + x[0]*par[1]

<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">create a linear function for fitting</span>
f = TF1(<span style="color: #b9ca4a;">'pyf3'</span>,Linear(),-1.,1.,2)

<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">create and fill a histogram</span>
h = TH1F(<span style="color: #b9ca4a;">'h'</span>,<span style="color: #b9ca4a;">'test'</span>,100,-1.,1.)
f2 = TF1(<span style="color: #b9ca4a;">'cf2'</span>,<span style="color: #b9ca4a;">'6.+x*4.5'</span>,-1.,1.)
h.FillRandom(<span style="color: #b9ca4a;">'cf2'</span>,10000)

<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">fit the histo with the python 'linear' function</span>
h.Fit(f)

<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">print results</span>
par = f.GetParameters()
<span style="color: #e78c45;">print</span> <span style="color: #b9ca4a;">'fit results: const ='</span>,par[0],<span style="color: #b9ca4a;">',pitch ='</span>,par[1]
</pre>
</div>
</div>
</div>
</div>
